In [1]:
import numpy as np
import pandas as pd

In [3]:
data = np.arange(10)
ex = pd.Series(data)
print(ex)
#creates a one-dimensional array-like object containing an array of data

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int32

In [5]:
ex1 = pd.Series([2,4,6,7,10])
print(ex1)
print(ex1.tolist())
#converts a panda module series to python list

0     2
1     4
2     6
3     7
4    10
dtype: int64
[2, 4, 6, 7, 10]

In [9]:
ex2 = pd.Series([2,3,6,8,10])
ex3 = pd.Series([1,3,5,7,9])
print(ex2)
print(ex3)
print(ex2+ex3)
#adds/subtracts/multiple/divides two Pandas.

0     2
1     3
2     6
3     8
4    10
dtype: int64
0    1
1    3
2    5
3    7
4    9
dtype: int64
0     3
1     6
2    11
3    15
4    19
dtype: int64

In [12]:
dict = {"a":100, "b":200, "c":300, "d":400, "e":800}
ex4 = pd.Series(dict)
print(ex4)
#converts a dictionary to a Pandas series.

a    100
b    200
c    300
d    400
e    800
dtype: int64

In [15]:
arr = np.array([10, 20, 30, 40, 50])
ex5 = pd.Series(arr)
print(ex5)
#converts a NumPy array to a Pandas Series.

0    10
1    20
2    30
3    40
4    50
dtype: int32

In [22]:
ex6 = pd.Series(["100", "200", "python", "300.12", "400"])
ex7 = pd.to_numeric(ex6, errors = "coerce")
print(ex7)

0    100.00
1    200.00
2       NaN
3    300.12
4    400.00
dtype: float64

In [23]:
data = {"col1": [1,2,3,4,7,11],
        "col2": [4,5,6,9,5,0],
        "col3": [7, 5, 8, 12, 1, 11]}
ex8 = pd.DataFrame(data)
print(ex8)
#converts a dict into a Pandas DataFrame.

   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1
5    11     0    11

In [32]:
ex9 = ex6.to_list()
arr2 = np.array(ex9)
print(arr2)
#converts a series to list and then to an array.

['100' '200' 'python' '300.12' '400']

In [36]:
data2 = (["Red","Green","White"],["Red","Black"],["Yellow"])
ex10 = pd.Series(data2)
print(ex10)
ex10 = ex10.apply(pd.Series).stack().reset_index(drop=True)
print(ex10)
#combines the series of list to one series.

0    [Red, Green, White]
1           [Red, Black]
2               [Yellow]
dtype: object
0       Red
1     Green
2     White
3       Red
4     Black
5    Yellow
dtype: object

In [37]:
ex11 = pd.Series(ex6).sort_values()
print(ex11)
#sorts the Series.

0       100
1       200
3    300.12
4       400
2    python
dtype: object

In [40]:
ex12 = pd.Series([500, "php"])
ex13 = ex11.append(ex12)
print(ex13)
#adds some data to an existing Series.

0       100
1       200
3    300.12
4       400
2    python
0       500
1       php
dtype: object

In [45]:
ex14 = pd.Series([0,1,2,3,4,5,6,7,8,9,10])
n = 6
ex15 = ex14[ex14<n]
print(ex15)
#creates a subset of a given series based on value and condition.

0    0
1    1
2    2
3    3
4    4
5    5
dtype: int64

In [3]:
ex15 = pd.Series([1,2,3,4,5])
ex16 = pd.Series([2,4,6,8,10])
ex17 = ex15[~ex15.isin(ex16)]
print(ex17)
#gets the items of a given series not present in another given series. 
#the ~ signs excludes all the values that is in ex16 and only output that are not.

0    1
2    3
4    5
dtype: int64

In [4]:
ex18 = pd.Series(np.union1d(ex15,ex16))
ex19 = pd.Series(np.intersect1d(ex15,ex16))
ex20 = ex18[~ex18.isin(ex19)]
print(ex20)

0     1
2     3
4     5
5     6
6     8
7    10
dtype: int64

In [10]:
ex21 = pd.Series(np.random.randn(20))
print(ex21)
ex21.describe()
#prints statistics of the Series. Can use percentile to just get the 
#25%, 50%, and 75%.

0     0.065600
1     1.293047
2     1.026994
3    -1.010512
4    -1.268486
5    -1.786067
6     1.732732
7    -0.321660
8    -1.147355
9    -0.482087
10    0.357386
11    0.773475
12   -0.521067
13    0.487500
14   -0.221796
15   -2.255981
16    0.495668
17   -0.404265
18    0.498181
19   -2.171218
dtype: float64

count    20.000000
mean     -0.242996
std       1.118510
min      -2.255981
25%      -1.044723
50%      -0.271728
75%       0.496296
max       1.732732
dtype: float64

In [22]:
exam_data = {'name':['Anastasia','Dima','Katherine','James','Emily','Micheal','Matthew','Laura','Kevin','Jonas'],
             'score':[12.5,9,16.5,np.nan,9,20,14.5,np.nan,8,19],
             'attempts':[1,3,2,3,2,3,1,1,2,1],
             'qualify':['yes','no','yes','no','no','yes','yes','no','no','yes']}

In [23]:
ex22 = pd.DataFrame(exam_data, index=['a','b','c','d','e','f','g','h','i','j'])
ex22

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Micheal   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [4]:
print(ex22.info())

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes
None

In [6]:
ex22[:3] #gets the first  rows of a given DataFrame.

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [11]:
print(ex22[["name","score"]])
#selects the 'name' and 'score' columns from the following DataFrame.

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Micheal   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

In [15]:
print(ex22.iloc[[1,3,5,6],[0,1]])
#selects 'name' and 'score' comulns in rows 1,3,5,6 from the following data frame.

      name  score
b     Dima    9.0
d    James    NaN
f  Micheal   20.0
g  Matthew   14.5

In [22]:
ex22[ex22['attempts']>2]
#selects the rows where the number of attempts in the examination is greater
#than 2.

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Micheal   20.0         3     yes

In [40]:
ex22[ex22['score'].isnull()]
#selects the rows where the score is missing.

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

In [34]:
ex22[ex22['score'].between(15,20)]
#selects the rows where the score is between 15 and 20 (inclusive).

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Micheal   20.0         3     yes
j      Jonas   19.0         1     yes

In [39]:
ex23= ex22[ex22['attempts']<2]
ex23[ex23['score']>15]
#selects the rows where number of attempts in the examination is less than 2 
#and score greater than 15. Can be done by combining both codes with &.

    name  score  attempts qualify
j  Jonas   19.0         1     yes

In [45]:
ex22.loc['d','score'] = 11.5
ex22
#changes the score to 11.5 in row 'd'.

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Micheal   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [63]:
new_date ={'name':["Suresh"],
           'score':[15.5],
           'attempts':[1],
           'qualify':["yes"]}
ex24 = pd.DataFrame(new_date, index= ['k'])
ex22 = ex22.append(ex24)
ex22
#adds a new row 'k' to data frame with given values for each column.

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Micheal   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
k     Suresh   15.5         1     yes

In [20]:
ex25 = ex22.drop('k')
ex25
#deletes the row 'k' from the data frame.

NameError: name 'ex22' is not defined

In [71]:
ex22.sort_values(by=['name','score'], ascending= [False,True])
#sorts the data frame by name and score in descending and ascending order.

        name  score  attempts qualify
k     Suresh   15.5         1     yes
f    Micheal   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
b       Dima    9.0         3      no
a  Anastasia   12.5         1     yes

In [73]:
ex22['name'] = ex22['name'].replace('James','Suresh')
ex22
#changes the name 'James' to 'Suresh'

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d     Suresh    NaN         3      no
e      Emily    9.0         2      no
f    Micheal   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
k     Suresh   15.5         1     yes

In [8]:
data1 = {"col1": [1,4,3,4,5],
         "col2": [4,5,6,7,8],
         "col3": [7,8,9,0,1]}
ex26 = pd.DataFrame(data1)
ex26

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

In [9]:
data3 = {"col1":[10],
        "col2":[11],
        "col3":[12]}
ex27 = pd.DataFrame(data3)
ex26 = ex26.append(ex27, ignore_index=True)
ex26

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
5    10    11    12

In [18]:
ex26.iloc[[2]]
#selects a row of series/dataframe by given integer index.

   col1  col2  col3
2     3     6     9

In [26]:
ex22
ex22.fillna(0)
#replaces all the NaN values with Zero's in a column of a dataframe.

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    0.0         3      no
e      Emily    9.0         2      no
f    Micheal   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    0.0         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [28]:
ex22
sum(ex22["score"].isnull())
#counts the NaN values in one or more colums in DataFrame.

2

In [30]:
ex26
ex26.drop([2, 4])
#drops the 2nd and 4th rows from the dataframe.

   col1  col2  col3
0     1     4     7
1     4     5     8
3     4     7     0
5    10    11    12

In [35]:
arr = np.random.randn(20).reshape(10,2)
ex28 = pd.DataFrame(arr)
ex28

          0         1
0 -0.324572  1.396311
1 -0.475880 -0.427897
2  1.073780 -0.388341
3  0.110719  0.419962
4  0.797108  0.465804
5  0.731268 -1.083567
6  0.295926  1.190344
7 -0.409269  1.103455
8  0.466568  1.491941
9  1.142663 -0.909322

In [36]:
part_70 = ex28.sample(frac=0.7, random_state=10)
part_30 = ex28.drop(part_70.index)
print(part_70)
print(part_30)
#divides the data frame in a given ratio. in this case splits the data frame
#in 70% and 30%.

          0         1
8  0.466568  1.491941
2  1.073780 -0.388341
5  0.731268 -1.083567
6  0.295926  1.190344
3  0.110719  0.419962
1 -0.475880 -0.427897
0 -0.324572  1.396311
          0         1
4  0.797108  0.465804
7 -0.409269  1.103455
9  1.142663 -0.909322

In [40]:
ex29 = pd.Series([100, 200, "python", 300.12, 400])
ex30 = pd.Series([10, 20, "php", 30.12, 40])
ex31 = pd.concat([ex29, ex30], axis= 1)
ex31
#combines two series into a DataFrame.

        0      1
0     100     10
1     200     20
2  python    php
3  300.12  30.12
4     400     40

In [44]:
ex31.rename(columns={0:"Column1"})
#renames a specific name in a given DataFrame.

  Column1      1
0     100     10
1     200     20
2  python    php
3  300.12  30.12
4     400     40

In [53]:
print(ex26)
ex26["col2"].tolist()
#gets a list of a specified column of a DataFrame.

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
5    10    11    12

[4, 5, 6, 7, 8, 11]

In [57]:
arr2 = np.zeros(30).reshape(10,3)
index = ["Index"+str(i) for i in range(1,11)]
ex32 = pd.DataFrame(arr2, index=index, columns=["Column1", "Column2", "Column3"])
ex32
#creates a DataFrame from a Numpy array with specific index and column headers.

         Column1  Column2  Column3
Index1       0.0      0.0      0.0
Index2       0.0      0.0      0.0
Index3       0.0      0.0      0.0
Index4       0.0      0.0      0.0
Index5       0.0      0.0      0.0
Index6       0.0      0.0      0.0
Index7       0.0      0.0      0.0
Index8       0.0      0.0      0.0
Index9       0.0      0.0      0.0
Index10      0.0      0.0      0.0